Revit 2027 API
DocumentChangedEventArgs.GetAddedElementIds Method
 Returns set of elements newly added to the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAddedElementIds()
Public Function GetAddedElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAddedElementIds()
member GetAddedElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The set of ElementId for elements newly added to the document.
See Also
Reference
DocumentChangedEventArgs Class
GetAddedElementIds Overload
Autodesk.Revit.DB.Events Namespace